##  Handlining Duplicate Data :


Duplicate observations most frequently arise duringÂ data collection, such as when we:

  - Combine datasets from multiple places
  - Scrape data ( Collect Data through web scraping)
  - Receive data from clients/other departments

In [20]:
# import the required libraries
import pandas as pd

In [21]:
# creating a dataFrame with duplicate rows
df = pd.DataFrame({"Name":["John", "Rock", "Neil", "Tom","John","John"], "Rank":[1,2,3,6,1,1], "Marks":[98,59,97,99,98,98]})
df

   Name  Rank  Marks
0  John     1     98
1  Rock     2     59
2  Neil     3     97
3   Tom     6     99
4  John     1     98
5  John     1     98

In [22]:
df.duplicated(keep=False)

0     True
1    False
2    False
3    False
4     True
5     True
dtype: bool

In [23]:
df.duplicated(keep=False).sum()

3

In [24]:
df.duplicated().sum()
# keep = First

2

In [25]:
# print the duplicate dataset
df.loc[df.duplicated(keep=False)]

   Name  Rank  Marks
0  John     1     98
4  John     1     98
5  John     1     98

In [26]:
# keep : {'first', 'last', False}, default 'first'
# Drop duplicates except for the first occurrence.
df1 = df.drop_duplicates(keep='first')
df1

   Name  Rank  Marks
0  John     1     98
1  Rock     2     59
2  Neil     3     97
3   Tom     6     99

In [27]:
# removes all duplicate rows
df2 = df.drop_duplicates(keep=False) # False --Drop all duplicates.
df2

   Name  Rank  Marks
1  Rock     2     59
2  Neil     3     97
3   Tom     6     99

In [28]:
# Drop duplicates except for the last occurrence.
df3 = df.drop_duplicates(keep="last")
df3

   Name  Rank  Marks
1  Rock     2     59
2  Neil     3     97
3   Tom     6     99
5  John     1     98

In [29]:
df.drop_duplicates(keep="first")
# inplace = False

   Name  Rank  Marks
0  John     1     98
1  Rock     2     59
2  Neil     3     97
3   Tom     6     99

In [30]:
df

   Name  Rank  Marks
0  John     1     98
1  Rock     2     59
2  Neil     3     97
3   Tom     6     99
4  John     1     98
5  John     1     98

In [31]:
# changing the dataset by settig inplace  to true
df.drop_duplicates(keep='first', inplace=True)
df

   Name  Rank  Marks
0  John     1     98
1  Rock     2     59
2  Neil     3     97
3   Tom     6     99